models/SignupForm.php

    public function signup()
    {
        if (!$this->validate()) {
            return null;
        }

        $user = new User();
        $user->username = $this->username;
        $user->email = $this->email;
        $user->password = $this->password;


        return $user->save() ? $user : null;
---
INSERT INTO `user` (`username`, `email`, `password`) VALUES ('Dimas', 'asdasd@gmail.com', '123456')